app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts" LIMIT $1  [["LIMIT", 11]]
---
    def index
			 @posts = Post.posts_by(current_user).page(params[:page]).per(10)