app/controllers/posts_controller.rb

INSERT INTO "posts" ("date", "rationale", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["date", "2019-01-02"], ["rationale", "sdfasdf"], ["created_at", "2019-01-05 23:14:46.945360"], ["updated_at", "2019-01-05 23:14:46.945360"], ["user_id", 1]]
---
    def create
        @post = Post.new(post_params)
	    @post.user_id = current_user.id

        if @post.save

UPDATE "posts" SET "date" = $1, "rationale" = $2, "updated_at" = $3 WHERE "posts"."id" = $4  [["date", "2017-01-19"], ["rationale", "ccc rationale content"], ["updated_at", "2019-01-29 03:13:25.726470"], ["id", 1]]
---
    def update
        if  @post.update(post_params)